app/controllers/admin/users_controller.rb

SELECT * FROM `groups` WHERE (`groups`.`group_name` = 'common') LIMIT 1
SELECT * FROM `users` WHERE (`users`.group_id = 2)
---
  def index
    @common_users=Group.first(:conditions=>{:group_name=>'common'}).users

SELECT * FROM `groups` WHERE (`groups`.`group_name` = 'admin') LIMIT 1
INSERT INTO `users` (`created_at`, `updated_at`, `group_id`, `nick_name`, `password`, `email`, `picture`, `active`) VALUES('2009-12-28 18:33:31', '2009-12-28 18:33:31', 1, '2', '2', '2', NULL, 1)
---
  def create
    @user = User.new(params[:user])
    @user.group=Group.first(:conditions=>{:group_name=>'admin'})
    respond_to do |format|
      if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 2)
UPDATE `users` SET `updated_at` = '2009-12-28 17:07:49', `active` = 0 WHERE `id` = 2
---
  def change_state
   @user= User.find(params[:id])
   state=@user.active
  if  state
    state=false
  else
    state=true
  end
  @user.active=state
   if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 3)
---
  def update
    @user = User.find(params[:id])