app/controllers/blogs_controller.rb

SELECT * FROM `posts` WHERE (`posts`.user_id = 3)
SELECT * FROM `users` WHERE (`users`.`id` = 3)
---
  def  show
    @posts=User.find(params[:id]).posts

SELECT * FROM `users` WHERE (`users`.group_id = 2)
---
  def search
    @users=User.all

SELECT * FROM `users` WHERE (`users`.`id` = 2)
SELECT `users`.id FROM `users` INNER JOIN `follows` ON `users`.id = `follows`.master_id WHERE (`users`.`id` = 2) AND (`follows`.follower_id = 14 ) LIMIT 1
---
  def follow
      @user=User.find(params[:id])
      if current_user.masters.include?(@user)