app/controllers/posts_controller.rb

INSERT INTO `posts` (`created_at`, `updated_at`, `user_id`, `category_id`, `content`, `description`) VALUES('2009-12-29 06:36:10', '2009-12-29 06:36:10', 3, 2, '11', '11')
---
  def create
    @post = Post.new(params[:post])
    @post.user_id=session[:user_id]
    respond_to do |format|
      if @post.save