app/controllers/replies_controller.rb

SELECT * FROM `posts` WHERE (`posts`.`id` = 14)
SELECT * FROM `replies` WHERE (`replies`.post_id = 14)
---
  def index
    @replies = Post.find(params[:post_id]).replies

SELECT * FROM `replies` WHERE (`replies`.`id` = 1)
---
  def show
    @reply = Reply.find(params[:id])

INSERT INTO `replies` (`created_at`, `updated_at`, `post_id`, `user_id`, `content`) VALUES('2009-12-29 07:54:15', '2009-12-29 07:54:15', 14, NULL, '111')
---
  def create
    @reply = Reply.new(params[:reply])
    @reply.post_id =params[:post_id]
    @reply.user_id =session[:user_id]
    respond_to do |format|
      if @reply.save

SELECT * FROM `replies` WHERE (`replies`.`id` = 3)
DELETE FROM `replies` WHERE `id` = 3
---
  def destroy
    @reply = Reply.find(params[:id])
    @reply.destroy