app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    @user.group=Group.first(:conditions=>{:group_name=>'common'})
    upload
    respond_to do |format|
      if @user.save
---
SELECT * FROM `groups` WHERE (`groups`.`group_name` = 'common') LIMIT 1
INSERT INTO `users` (`salt`, `created_at`, `blog_name`, `updated_at`, `hashed_password`, `blog_description`, `group_id`, `nick_name`, `email`, `picture`, `active`) VALUES('21756057600.236268047694269', '2009-12-31 02:27:40', 'yes or no', '2009-12-31 02:27:40', '8edf90e3ec42b0b6f7104cd4a929798cb70a0beb', 'hahhahahahhaha', 2, 'zhuzhews', 'zhuzheiswho@book.com', '/user_picture/407140.jpg', 1)

  def update
    @user = User.find(params[:id])
    @user.attributes=params[:user]
    upload
    respond_to do |format|
      if @user.save
---
SELECT * FROM `users` WHERE (`users`.`id` = 3)
UPDATE `users` SET `updated_at` = '2009-12-29 07:14:30', `picture` = '--- !ruby/object:File \ncontent_type: image/jpeg\noriginal_path: !binary |\n LWltYWdlUGljLeWKqOa8q+Wjgee6uC3ml6XmnKxDR+WKqOeUu+e+juWls+Wb\n vueJh+Wjgee6uC0wLmpwZw==\n\n' WHERE `id` = 3